# Задание 6
string1 = input("Введите первую строку: ")
string2 = input("Введите вторую строку: ")
string3 = input("Введите третью строку: ")
print(string3)
print(string2)
print(string1)