# Задание 1

password = input("Введите пароль: ")
password_again = input("Повторите пароль: ")
if password == password_again:
    print("Успешно!")
else:
    print("Ошибка!")